import moment from 'moment';

export const faqAr = [
    {
        key: 0,
        title: 'ترتيب',
        questions: [
            {
                key: 0,
                question: 'هل يمكنني تقديم طلب في وقت لاحق؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 1,
                question: 'إعادة طلب الطعام الذي تم طلبه مسبقًا',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 2,
                question: 'ما هو البيك اب؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 3,
                question: 'هل يمكنني إضافة تعليمات طبخ خاصة؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 4,
                question: 'المطعم غير متوفر في منطقتي',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 5,
                question: 'طلب واحد في عدة مطاعم',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 6,
                question: 'هل يمكنني تقديم طلب لشخص آخر؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            }
        ]
    },
    {
        key: 1,
        title: 'توصيل',
        questions: [
            {
                key: 0,
                question: 'هل يمكنني تقديم طلب في وقت لاحق؟Can I place an order for later?',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 1,
                question: 'إعادة طلب الطعام الذي تم طلبه مسبقًا',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 2,
                question: 'ما هو البيك اب؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 3,
                question: 'هل يمكنني إضافة تعليمات طبخ خاصة؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 4,
                question: 'المطعم غير متوفر في منطقتي',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 5,
                question: 'طلب واحد في عدة مطاعم',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 6,
                question: 'هل يمكنني تقديم طلب لشخص آخر؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            }
        ]
    },
    {
        key: 2,
        title: 'التسعير',
        questions: [
            {
                key: 0,
                question: 'هل يمكنني تقديم طلب في وقت لاحق؟Can I place an order for later?',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 1,
                question: 'إعادة طلب الطعام الذي تم طلبه مسبقًا',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 2,
                question: 'ما هو البيك اب؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 3,
                question: 'هل يمكنني إضافة تعليمات طبخ خاصة؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 4,
                question: 'المطعم غير متوفر في منطقتي',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 5,
                question: 'طلب واحد في عدة مطاعم',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 6,
                question: 'هل يمكنني تقديم طلب لشخص آخر؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            }
        ]
    },
    {
        key: 3,
        title: 'اعمل معنا',
        questions: [
            {
                key: 0,
                question: 'هل يمكنني تقديم طلب في وقت لاحق؟Can I place an order for later?',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 1,
                question: 'إعادة طلب الطعام الذي تم طلبه مسبقًا',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 2,
                question: 'ما هو البيك اب؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 3,
                question: 'هل يمكنني إضافة تعليمات طبخ خاصة؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 4,
                question: 'المطعم غير متوفر في منطقتي',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 5,
                question: 'طلب واحد في عدة مطاعم',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            },
            {
                key: 6,
                question: 'هل يمكنني تقديم طلب لشخص آخر؟',
                answer: 'نعم ، يمكنك الطلب حتى 3 أيام مقدمًا. أثناء الطلب ، يمكنك اختيار التاريخ والوقت اللذين تريد توصيل وجبتك فيهما. الافتراضي هو "في أقرب وقت ممكن.`',
            }
        ]
    }
]
export const vouchersAr = [
    {
        key: 0,
        question: 'كيف يمكنني استرداد قسيمة؟',
        answer: 'يمكنك تطبيق قسيمة من محفظتك أثناء الخروج. بدلاً من ذلك ، أدخل الرمز على شاشة الخروج.',
        steps: [
            `إذا كانت إيصال تعويض أو إيصال فريد تلقيته ، فيجب ألا يكون هذا الإيصال قد تم تطبيقه مسبقًا على أي طلب آخر ولا يمكن دمجه مع إيصال آخر في طلب واحد.`,
            `إذا كانت حملة نقوم بتشغيلها ، فيمكنك استخدام رمز القسيمة حتى تنتهي الحملة`,
            `يجب تطبيق القسائم قبل تقديم الطلب.`,
            `يمكن استخدام كل قسيمة تعويض أو رمز قسيمة فريد مرة واحدة فقط. إذا كانت لديك قيمة طلب أقل من قيمة قسيمتك ، فلن تتمكن من استخدام باقي الرصيد لاحقًا.`
        ]
    },
    {
        key: 1,
        question: `رمز قسيمتي لا يعمل`,
        answer: 'يمكنك تطبيق قسيمة من محفظتك أثناء الخروج. بدلاً من ذلك ، أدخل الرمز على شاشة الخروج.',
        steps: [
            `إذا كانت إيصال تعويض أو إيصال فريد تلقيته ، فيجب ألا يكون هذا الإيصال قد تم تطبيقه مسبقًا على أي طلب آخر ولا يمكن دمجه مع إيصال آخر في طلب واحد.`,
            `إذا كانت حملة نقوم بتشغيلها ، فيمكنك استخدام رمز القسيمة حتى تنتهي الحملة`,
            `يجب تطبيق القسائم قبل تقديم الطلب.`,
            `يمكن استخدام كل قسيمة تعويض أو رمز قسيمة فريد مرة واحدة فقط. إذا كانت لديك قيمة طلب أقل من قيمة قسيمتك ، فلن تتمكن من استخدام باقي الرصيد لاحقًا.`
        ]
    },
    {
        key: 2,
        question: 'لم تحصل على خصم الإحالة',
        answer: 'يمكنك تطبيق قسيمة من محفظتك أثناء الخروج. بدلاً من ذلك ، أدخل الرمز على شاشة الخروج.',

    },
    {
        key: 3,
        question: `لدي سؤال أو مشكلة قسيمة أخرى`,
        answer: 'يمكنك تطبيق قسيمة من محفظتك أثناء الخروج. بدلاً من ذلك ، أدخل الرمز على شاشة الخروج.',
    }
]
export const paymentsAr = [
    {
        key: 0,
        question: 'إضافة أو حذف طريقة الدفع',
        answer: `أثناء عملية الطلب ، يُطلب منك اختيار طريقة الدفع. من خلال إدخال تفاصيل الدفع ، يمكنك العثور على مربع الاختيار الذي يسألك عما إذا كنت ترغب في تخزين تفاصيل الدفع للطلبات المستقبلية.

        إذا كنت قد قمت بتخزين تفاصيل الدفع بالفعل وتريد إزالتها ، يمكنك الانتقال إلى حسابك وفي قسم مدفوعاتي ، يمكنك حذفها.`,
        // steps: [
        //     `If it's a compensation voucher or a unique voucher you received, this voucher must not have been previously applied to any other order and cannot be combined with another voucher in a single order.`,
        //     `If it's a campaign we are running, you can use the voucher code until the campaign is over`,
        //     `Vouchers must be applied before you place an order.`,
        //     `Each compensation voucher or unique voucher code can be used only once. If you have an order value that is less than the value of your voucher, you won’t be able to use the rest of the credit later.`
        // ]
    },
    {
        key: 1,
        question: `تم رفض دفعتي`,
        answer: `يمكن رفض الدفع عبر الإنترنت لعدة أسباب. ربما تكون قد أدخلت تفاصيل الدفع الخاصة بك بشكل غير صحيح أو أنك وصلت إلى حد بطاقتك الائتمانية.
        لحل هذه المشكلة ، جرب إحدى الخطوات التالية:`,
        steps: [
            `تحقق مع البنك الذي تتعامل معه بشأن تعديل حدود السحب أو الشراء اليومية.`,
            `تأكد من أن البنك الذي تتعامل معه لديه أحدث معلومات الاتصال الخاصة بك.`,
            `تحقق من أن لديك تفاصيل الدفع الحالية مخزنة في حساب Baetoti الخاص بك`,
            // `Each compensation voucher or unique voucher code can be used only once. If you have an order value that is less than the value of your voucher, you won’t be able to use the rest of the credit later.`
        ]
    },
    {
        key: 2,
        question: `زر الخروج لا يعمل`,
        answer: `إذا لم تتمكن من النقر فوق Checkout ، فسيتعين عليك على الأرجح إعادة تشغيل طلبك:
        - السبب الأكثر ترجيحًا هو أن شيئًا ما تغير أثناء تقديمك لطلبك ، مثل:
        - لم يعد الموفر متاحًا - لم يعد أحد عناصرك متوفرًا
        -تأكد أيضًا من التحقق من إدخال عنوان التسليم الخاص بك بشكل صحيح`,

    },
    {
        key: 3,
        question: `ما هي طرق الدفع المتوفرة؟`,
        answer: 'يمكنك الدفع من المحفظة أو الدفع عبر الإنترنت أثناء الطلب باستخدام بطاقة الائتمان أو الخصم.'
    },
    {
        key: 4,
        question: `لدي سؤال أو مشكلة دفع أخرى`,
        answer: `لا يمكنك العثور على إجابة لسؤالك هنا؟ املأ النموذج أدناه وسنعاود الاتصال بك في أقرب وقت ممكن.`,
        isShow:true
    }
]
export const myAccountAr = [
    {
        key: 0,
        question: 'تحديث معلومات الحساب',
        answer: `To قم بتغيير رقم هاتفك أو بريدك الإلكتروني المرتبط بحسابك ، اتبع الخطوات التالية:
        -الذهاب إلى قسم الملف الشخصي في التطبيق
        -الذهاب إلى المزيد> الإعدادات> إعدادات الأمان
        -يمكنك الآن تغيير معلومات الأمان الخاصة بك.
        -ملاحظة: لتغيير عنوان بريدك الإلكتروني ، ستحتاج إلى القيام بذلك في قسم الملف الشخصي على الويب. قم بتسجيل الدخول إلى الملف الشخصي وانقر فوق ملف التعريف الخاص بك.`,
        steps: [
            `إذا كانت إيصال تعويض أو إيصال فريد تلقيته ، فيجب ألا يكون هذا الإيصال قد تم تطبيقه مسبقًا على أي طلب آخر ولا يمكن دمجه مع إيصال آخر في طلب واحد.`,
            `إذا كانت حملة نقوم بتشغيلها ، فيمكنك استخدام رمز القسيمة حتى تنتهي الحملة`,
            `يجب تطبيق القسائم قبل تقديم الطلب.`,
            `يمكن استخدام كل قسيمة تعويض أو رمز قسيمة فريد مرة واحدة فقط. إذا كانت لديك قيمة طلب أقل من قيمة قسيمتك ، فلن تتمكن من استخدام باقي الرصيد لاحقًا.`
        ]
    },
    {
        key: 1,
        question: `لقد نسيت كلمة المرور`,
        answer: `لتغيير رقم هاتفك أو المعلومات الأخرى المرتبطة بحسابك.

        إذا كنت قد قمت بتخزين تفاصيل الدفع بالفعل وتريد إزالتها ، يمكنك الانتقال إلى حسابك وفي قسم مدفوعاتي ، يمكنك حذفها.`,
        steps: [
            `إذا كانت إيصال تعويض أو إيصال فريد تلقيته ، فيجب ألا يكون هذا الإيصال قد تم تطبيقه مسبقًا على أي طلب آخر ولا يمكن دمجه مع إيصال آخر في طلب واحد.`,
            `إذا كانت حملة نقوم بتشغيلها ، فيمكنك استخدام رمز القسيمة حتى تنتهي الحملة`,
            `يجب تطبيق القسائم قبل تقديم الطلب.`,
            `يمكن استخدام كل قسيمة تعويض أو رمز قسيمة فريد مرة واحدة فقط. إذا كانت لديك قيمة طلب أقل من قيمة قسيمتك ، فلن تتمكن من استخدام باقي الرصيد لاحقًا.`
        ]
    },
    {
        key: 2,
        question: `إلغاء الاشتراك في النشرة الإخبارية لدينا`,
        answer: 'يمكنك تطبيق قسيمة من محفظتك أثناء الخروج. بدلاً من ذلك ، أدخل الرمز على شاشة الخروج.',

    },
    {
        key: 3,
        question: `لدي سؤال حول الخصوصية`,
        answer: `في Baetoti ، نتعامل مع أمان وخصوصية بيانات المستخدم على محمل الجد. نحن نشارك المعلومات الضرورية فقط لتسليم طلبك وفقط مع الأطراف ذات الصلة (المزود والراكب الخاص بك). يتم الاحتفاظ بجميع المعلومات الأخرى خاصة.
        إذا كان لديك سؤال بخصوص كيفية تخزيننا لبياناتك وحمايتها ، أو كيف نستخدمها ، فأخبرنا بذلك أدناه. سنعود إليه بأسرع ما يمكن.`
    },
    {
        key: 4,
        question: `لا يمكنني التسجيل باستخدام رقم هاتفي`,
        answer: `
        -هل يمكنني استخدام خط أرضي؟ لا يمكن استخدام أرقام الخطوط الأرضية لأننا قد نحتاج إلى إرسال معلومات مهمة عن الطلب عبر رسالة نصية.
        -لقد تلقيت رسالة تقول "الرجاء إدخال رقم هاتف صالح" تأكد من إدخال رقم هاتف محمول بدون أحرف خاصة أو مسافات. على سبيل المثال (54xxxxxxx)
        -لقد تلقيت رسالة تقول "رقم هاتفك قيد الاستخدام بالفعل" اكتب رسالة أدناه وسنحاول حل هذه المشكلة نيابةً عنك.`
    },
    {
        key: 5,
        question: `لم أتلق رمز التحقق عبر الرسائل القصيرة`,
        answer: `إذا لم تكن قد تلقيت رمز التحقق عبر الرسائل القصيرة ، فتأكد من أن الرقم الذي أدخلته صحيح وأن لديك إشارة هاتف. إذا لم تستلم الرسالة النصية بعد ، يرجى محاولة طلب رمز التحقق مرة أخرى.`
    },
    {
        key: 6,
        question: `رقم الهاتف قيد الاستخدام بالفعل خطأ`,
        answer: `-لقد تلقيت خطأ أن رقم الهاتف قيد الاستخدام بالفعل
        -هناك حساب آخر برقم الهاتف هذا. حاول تسجيل الدخول إلى الحساب الذي يستخدم رقم الهاتف هذا. إذا لم تكن قد استخدمت رقم الهاتف هذا من قبل ، فيرجى الاتصال بنا.`
    }
]
export const safetyConcernAr = [
    'حادثة أمان تتعلق بالراكب الخاص بي',
    'مستحقات الدفع \ مشاكل الدفع',
    'قضية سلامة الغذاء',
    'مشكلة التسليم بدون تلامس'
]
export const myOrdersAr = [
    {
        key:0,
        resturantName:'Najeeb Spot',
        price:230,
        orderID:'ORD123ASET45',
        food:'Gol Gappay',
        date:'08 ,dec',
        time:'22:10'
    },
    {
        key:1,
        resturantName:'Juice Land',
        price:430,
        orderID:'ORD123ASET45',
        food:'Orange Juice',
        date:'08 ,dec',
        time:'22:10'
    },
    {
        key:2,
        resturantName:'Howdy',
        price:430,
        orderID:'ORD123ASET45',
        food:'Chesse Burger',
        date:'08 ,dec',
        time:'22:10'
    },
    
]
export const mySupportRequestAr = [
    {
        key:0,
        topic:'information Request',
        issue:'information Request',
        date:'08 ,dec',
        time:'22:10',
        messageDetials:[
            {
                key:0,
                meassage:`Dear Ahmad Hasham,

                Thank you for reaching out to us.
                
                Please know that we are unable to investigate your issue at the moment because we can’t navigate regarding the order you have placed and for which you are inquiring.
                
                If you could please share your contact details/ E-mails or the order code so that your query is resolved accordingly.
                
                Kindly reply to this email or contact us via Live Chat if there is anything else we can assist you with.
                
                Thank you.
                
                Warm regards,
                Amber Naz,
                betoti Customer Care Team
                Website | www.betoti.com
                ref:_00Dw0l3C7._5006932UY5D:ref`,
                type:'Agent',
                time:moment().format('MM Do YY, h:mm:ss a')
            }
        ]
    },
    {
        key:1,
        topic:'information Request',
        issue:'information Request',
        date:'08 ,dec',
        time:'22:10',
        messageDetials:[
            {
                key:0,
                meassage:`Dear Ahmad Hasham,

                Thank you for reaching out to us.
                
                Please know that we are unable to investigate your issue at the moment because we can’t navigate regarding the order you have placed and for which you are inquiring.
                
                If you could please share your contact details/ E-mails or the order code so that your query is resolved accordingly.
                
                Kindly reply to this email or contact us via Live Chat if there is anything else we can assist you with.
                
                Thank you.
                
                Warm regards,
                Amber Naz,
                foodpanda Customer Care Team
                Website | www.foodpanda.pk
                ref:_00Dw0l3C7._5006932UY5D:ref`,
                type:'Agent',
                time:moment().format('MM Do YY, h:mm:ss a')
            }
        ]
    }
]